<a href="https://colab.research.google.com/github/Pavani834/december/blob/main/SQLite3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

connect to database

In [ ]:
import sqlite3
conn=sqlite3.connect('test.db')
print("opened database successfully")

opened database successfully

create a table

In [ ]:
import sqlite3
conn=sqlite3.connect('trst.db')
print("opened database successfully")
conn.execute('''CREATE TABLE EMPLOYEE1
             (ID INT PRIMARY KEY  NOT NULL,
             NAME  TEXT  NOT NULL,
             AGE  INT NOT NULL,
             ADDRESS   CHAR(50),
             SALARY    REAL);''')
print("Table created successfully" )

opened database successfully
Table created successfully

In [ ]:
()import sqlite3
conn=sqlite3.connect('stdts.db')
print("opened database successflly")
conn.execute('''CREATE TABLE STUDENTS(ROLLNO  INT  PRIMARY KEY  NOT NULL,NAME  TEXT  NOT NULL,MARKS1 INT NOT NULL,MARKS2 INT NOT NULL,TOTAL INT NOT NULL);''')
print("Table created successfully")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(1,'ILA',45,7,52)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(2,'PRANAYINI',40,40,80)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(3,'ALIEN',35,35,70)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(4,'PAUL',10,10,20)")
conn.commit()
print("records created successfully")
conn.close

opened database successflly
Table created successfully
records created successfully

In [ ]:
import sqlite3
conn=sqlite3.connect('stdts.db')
print("opened database successflly")
conn.execute('''CREATE TABLE STUDENTS(ROLLNO  INT  PRIMARY KEY  NOT NULL,NAME  TEXT  NOT NULL,MARKS1 INT NOT NULL,MARKS2 INT NOT NULL,TOTAL INT NOT NULL);''')
print("Table created successfully")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(1,'ILA',45,7,52)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(2,'PRANAYINI',40,40,80)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(3,'ALIEN',35,35,70)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(4,'PAUL',10,10,20)")
conn.commit()
print("records created successfully")
conn.execute("DELETE from STUDENTS WHERE ROLL=3")
conn.commit()
print("t")

In [ ]:

import sqlite3
conn=sqlite3.connect('stdts.db')
print("opened database successflly")
conn.execute('''CREATE TABLE STUDENTS(ROLLNO  INT  PRIMARY KEY  NOT NULL,NAME  TEXT  NOT NULL,MARKS1 INT NOT NULL,MARKS2 INT NOT NULL,TOTAL INT NOT NULL);''')
print("Table created successfully")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(1,'ILA',45,7,52)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(2,'PRANAYINI',40,40,80)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(3,'ALIEN',35,35,70)")
conn.execute("INSERT INTO STUDENTS (ROLLNO,NAME,MARKS1,MARKS2,TOTAL)\
VALUES(4,'PAUL',10,10,20)")
conn.commit()
print("records created successfully")
conn.close

In [ ]:
conn.execute("DELETE from STUDENTS WHERE ROLLNO=3")
conn.commit()
print("total number of rows deleted:",conn.total_changes)

total number of rows deleted: 6